# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Fri Mar 13 07:25:46 EDT 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design carry_save_adder_16bit

create_clock -name "vclk" -period 5.0 -waveform {0.0 2.5} 
set_load -pin_load 0.05 [get_ports {final_sum[17]}]
set_load -pin_load 0.05 [get_ports {final_sum[16]}]
set_load -pin_load 0.05 [get_ports {final_sum[15]}]
set_load -pin_load 0.05 [get_ports {final_sum[14]}]
set_load -pin_load 0.05 [get_ports {final_sum[13]}]
set_load -pin_load 0.05 [get_ports {final_sum[12]}]
set_load -pin_load 0.05 [get_ports {final_sum[11]}]
set_load -pin_load 0.05 [get_ports {final_sum[10]}]
set_load -pin_load 0.05 [get_ports {final_sum[9]}]
set_load -pin_load 0.05 [get_ports {final_sum[8]}]
set_load -pin_load 0.05 [get_ports {final_sum[7]}]
set_load -pin_load 0.05 [get_ports {final_sum[6]}]
set_load -pin_load 0.05 [get_ports {final_sum[5]}]
set_load -pin_load 0.05 [get_ports {final_sum[4]}]
set_load -pin_load 0.05 [get_ports {final_sum[3]}]
set_load -pin_load 0.05 [get_ports {final_sum[2]}]
set_load -pin_load 0.05 [get_ports {final_sum[1]}]
set_load -pin_load 0.05 [get_ports {final_sum[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[15]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[14]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[13]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[12]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[11]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[10]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[9]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[8]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[7]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[6]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[5]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[4]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[3]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[2]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[1]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {a[0]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[15]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[14]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[13]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[12]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[11]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[10]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[9]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[8]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[7]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[6]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[5]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[4]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[3]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[2]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[1]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {b[0]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[15]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[14]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[13]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[12]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[11]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[10]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[9]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[8]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[7]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[6]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[5]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[4]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[3]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[2]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[1]}]
set_input_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {c[0]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[17]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[16]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[15]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[14]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[13]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[12]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[11]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[10]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[9]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[8]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[7]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[6]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[5]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[4]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[3]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[2]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[1]}]
set_output_delay -clock [get_clocks vclk] -add_delay 1.0 [get_ports {final_sum[0]}]
set_input_transition 0.1 [get_ports {a[15]}]
set_input_transition 0.1 [get_ports {a[14]}]
set_input_transition 0.1 [get_ports {a[13]}]
set_input_transition 0.1 [get_ports {a[12]}]
set_input_transition 0.1 [get_ports {a[11]}]
set_input_transition 0.1 [get_ports {a[10]}]
set_input_transition 0.1 [get_ports {a[9]}]
set_input_transition 0.1 [get_ports {a[8]}]
set_input_transition 0.1 [get_ports {a[7]}]
set_input_transition 0.1 [get_ports {a[6]}]
set_input_transition 0.1 [get_ports {a[5]}]
set_input_transition 0.1 [get_ports {a[4]}]
set_input_transition 0.1 [get_ports {a[3]}]
set_input_transition 0.1 [get_ports {a[2]}]
set_input_transition 0.1 [get_ports {a[1]}]
set_input_transition 0.1 [get_ports {a[0]}]
set_input_transition 0.1 [get_ports {b[15]}]
set_input_transition 0.1 [get_ports {b[14]}]
set_input_transition 0.1 [get_ports {b[13]}]
set_input_transition 0.1 [get_ports {b[12]}]
set_input_transition 0.1 [get_ports {b[11]}]
set_input_transition 0.1 [get_ports {b[10]}]
set_input_transition 0.1 [get_ports {b[9]}]
set_input_transition 0.1 [get_ports {b[8]}]
set_input_transition 0.1 [get_ports {b[7]}]
set_input_transition 0.1 [get_ports {b[6]}]
set_input_transition 0.1 [get_ports {b[5]}]
set_input_transition 0.1 [get_ports {b[4]}]
set_input_transition 0.1 [get_ports {b[3]}]
set_input_transition 0.1 [get_ports {b[2]}]
set_input_transition 0.1 [get_ports {b[1]}]
set_input_transition 0.1 [get_ports {b[0]}]
set_input_transition 0.1 [get_ports {c[15]}]
set_input_transition 0.1 [get_ports {c[14]}]
set_input_transition 0.1 [get_ports {c[13]}]
set_input_transition 0.1 [get_ports {c[12]}]
set_input_transition 0.1 [get_ports {c[11]}]
set_input_transition 0.1 [get_ports {c[10]}]
set_input_transition 0.1 [get_ports {c[9]}]
set_input_transition 0.1 [get_ports {c[8]}]
set_input_transition 0.1 [get_ports {c[7]}]
set_input_transition 0.1 [get_ports {c[6]}]
set_input_transition 0.1 [get_ports {c[5]}]
set_input_transition 0.1 [get_ports {c[4]}]
set_input_transition 0.1 [get_ports {c[3]}]
set_input_transition 0.1 [get_ports {c[2]}]
set_input_transition 0.1 [get_ports {c[1]}]
set_input_transition 0.1 [get_ports {c[0]}]
set_wire_load_mode "enclosed"
## List of unsupported SDC commands ##
set_max_area 0
